In [1]:
import pandas as pd

In [22]:
df_titanic = pd.read_csv('titanic.csv')
df_titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [26]:
#Fiill missing values
df_titanic['Age'].fillna(df_titanic['Age'].mean(), inplace=True)
df_titanic['Cabin'].fillna(df_titanic['Cabin'].mode()[0], inplace=True)
df_titanic['Embarked'].fillna(df_titanic['Embarked'].mode()[0], inplace=True)

In [38]:
#1. How many passengers survived, and how many died?
survived = df_titanic['Survived'].value_counts(normalize=True).reset_index()
survived

   Survived  proportion
0         0    0.616162
1         1    0.383838

In [85]:
#2.Tasa de sobrevivencia respecto al sexo
df_sex = df_titanic.groupby(['Sex'])['Survived'].value_counts(normalize=True).reset_index(name='Survived_rate')
df_sex.head(11)

      Sex  Survived  Survived_rate
0  female         1       0.742038
1  female         0       0.257962
2    male         0       0.811092
3    male         1       0.188908

In [93]:
#3.
df_survived_class = df_titanic.groupby(['Pclass'])['Survived'].value_counts(normalize=True).reset_index(name='Survived_rate')
df_survived_class

   Pclass  Survived  Survived_rate
0       1         1       0.629630
1       1         0       0.370370
2       2         0       0.527174
3       2         1       0.472826
4       3         0       0.757637
5       3         1       0.242363

In [108]:
#4.
df_fem_older25 = df_titanic[(df_titanic['Age'] > 25) & (df_titanic['Sex']== 'female')]['Survived'].value_counts(normalize=True).reset_index(name='Survived_rate')
df_fem_older25

   Survived  Survived_rate
0         1       0.760417
1         0       0.239583